#include <stdio.h>   //177 50
#include <conio.h>   //94 **
#include <io.h>
#include <time.h>    //64 20
#include <windows.h>
#include <string.h>
int i, j, k, lselect=1; //1일 시 읽기(디코딩)
int bre=0, bre2=0, con=0;
int time_vaild();void gotoxy(int x, int y);void CursorView(); void RemoveEnter(char *sentence, int siz); void drawmain();void SSleep(int a_second); 
void CursorView(int a);void drawbody();void beforerand();void drawletter();void drawoletter();void eCoding(int a, char sentence[], int siz, char end_char);
int letter_limit[3][4] ={0,}; //유효기간 입력

int main(){
    system("mode con cols=177 lines=50");        //사전 설정 문단
    system("chcp 65001");
    system("cls");
    int k, cnt=0;
    char letter_top[61];
    char letter_bottom[61];
    char letter_ps[61];
    char letter_title[31];
    char letter_mainc[3]; //문단 수
    char letter_index[100][40]={'\0',};
    char path[8] = "*.let";
    char  *command;
    FILE *fp, *fp2;
    time_t t;
    intptr_t hFile;
    t = time(NULL);
    struct tm* monthandday;
    struct _finddatai64_t c_file;
    monthandday = localtime(&t);
    letter_limit[2][0] = monthandday->tm_year + 1900;
    letter_limit[2][1] = monthandday->tm_mon + 1;
    letter_limit[2][2] = monthandday->tm_mday;
    letter_limit[2][3] = monthandday->tm_hour;

    //---------------------------------------------------------------------------------------------------

    home:
    CursorView(0);                               
    while(!bre2) {
        drawbody();
        drawletter();
        while(!bre) {                //메인화면
            gotoxy(56, 32);
            printf("|                 편지 열기          편지로 변환               |");
            gotoxy(112, 33);
            printf("v1.3");
            if(lselect) gotoxy(71, 32);
            else gotoxy(90, 32);
            printf("√");
            switch(getch()) {
                case 'd': case 'a':
                    if(lselect==0) lselect=1;
                    else lselect=0;
                    break;
                case ' ':
                    bre=1;
                    break;
                default:
                    break;
            }
        }
        bre=0;                            

        //---------------------------------------------------------------------------------------------------
                                         
        if(lselect) strcpy(path, "*_");    //편지 검색&적재
        else strcpy(path, "*");
        if((hFile = _findfirsti64(path, &c_file))==-1L) {
            gotoxy(57, 32);
            switch(errno) {
                case ENOENT:
                    printf("현재 동작에 맞는 파일을 찾을 수 없습니다"); break;
                case EINVAL:
                    printf("편지 형식의 파일을 찾을 수 없습니다 (임의로 번경하셨나요?)\n"); _findclose(hFile); break;
                case ENOMEM:
                    printf("파일 이름이 너무 깁니다\n"); _findclose(hFile); break;
                default:
                    printf("알 수 없는 오류입니다.\n"); _findclose(hFile); break;
            }
            SSleep(3);
            goto home;
        }
        else {
            cnt=0;
            strcpy(letter_index[cnt], c_file.name);
            for(cnt=1;_findnexti64(hFile, &c_file)==0;cnt++){
                strcpy(letter_index[cnt], c_file.name);
            } 
            _findclose(hFile); // _findfirsti64(), _findnexti64()에 사용된 메모리를 반환
        }

        //---------------------------------------------------------------------------------------------------
        
        drawoletter();
        i=0;
        while(!bre) {
            con=0;
            for(j=13;j<18;j++) {
                gotoxy(56,19+j);
                printf("|                                                              |");
            }
            for(j=(i/18)*18;j<(((i/18)+1)*18)&&j<cnt;j++) {
                if(i==cnt/18*18&&i) {
                    drawoletter();
                    for(k=13;k<18;k++) {
                        gotoxy(56,19+k);
                        printf("|                                                              |");
                    }
                }
                if(!((j/9)%2)) {
                    gotoxy(63, 14+j%9);
                    printf("  %-22s", letter_index[j]);
                }
                else {
                    gotoxy(87, 14+j%9);
                    if(j%2) printf("| ");
                    else printf(" |");
                    printf("  %-22s", letter_index[j]);
                }
                if(i==j) {
                    if(!((j/9)%2)) gotoxy(63, 14+j%9);
                    else gotoxy(89, 14+j%9);
                    printf("√");
                }
                gotoxy(85, 29);
                printf("- %02d -", j/18+1);
            }
            gotoxy(57, 34);
            printf("        [이 파일이 곧 편지라면 space bar를 눌러주세요]     ");
            switch(getch()) {
                case ' ':
                    con=1;
                    break;
                case 'd':
                    if(i+1<cnt) i++;
                    break;
                case 'a':
                    if(i-1>=0) i--;
                    break;
                default:
                    break;
            }
            if(!con) continue;
            gotoxy(57, 34);
            printf("                                                          ");
            strcpy(letter_title, letter_index[i]);
            fp=fopen(letter_title, "r");                       //편지 읽기 
            fgets( letter_top, sizeof(letter_top), fp);
            fgets( letter_bottom, sizeof(letter_bottom), fp);
            fgets( letter_ps, sizeof(letter_ps), fp);
            RemoveEnter(letter_top, sizeof(letter_top));
            RemoveEnter(letter_bottom, sizeof(letter_bottom));
            RemoveEnter(letter_ps, sizeof(letter_ps));
            if(lselect) {                                            //읽기 시 디코딩
                beforerand(1);
                eCoding(0, letter_top, sizeof(letter_top), '\0');
                eCoding(0, letter_bottom, sizeof(letter_bottom), '\0');
                eCoding(0, letter_ps, sizeof(letter_ps), '\0');
            }
            for(k=0;k<8;k++) {
                letter_limit[k/4][k%4]=0;
            }
            for(k=0;k<20;k++) {
                switch(k%10) {
                case 0: j=1000; case 1: case 2: case 3:
                    letter_limit[k/10][0]+=(letter_ps[k]-48)*j;
                    j/=10;
                    break;
                case 4: j=10; case 5:
                    letter_limit[k/10][1]+=(letter_ps[k]-48)*j;
                    j/=10;
                    break;
                case 6: j=10; case 7:
                    letter_limit[k/10][2]+=(letter_ps[k]-48)*j;
                    j/=10;
                    break;
                case 8: j=10; case 9:
                    letter_limit[k/10][3]+=(letter_ps[k]-48)*j;
                    j/=10;
                    break;
                default:
                    break;
                }
            }
            if(time_vaild()) {
                gotoxy(57, 32);                                                //단계 진입 전 안내문구
                printf("     %s에게                  ", letter_top);
                gotoxy(57, 33);
                printf("      %d.%02d.%02d/%02d ~ %d.%02d.%02d/%02d, %s 가", letter_limit[1][0], letter_limit[1][1], letter_limit[1][2], letter_limit[1][3], letter_limit[0][0], letter_limit[0][1], letter_limit[0][2], letter_limit[0][3], letter_bottom);
                gotoxy(57, 35);
                if(lselect) {
                    printf("         [읽기를 시작하시려면 space bar를 눌러주세요]     ");
                }
                else {
                    printf("         [변환을 시작하시려면 space bar를 눌러주세요]     ");
                }
                switch(getch()) {
                    case ' ':
                        bre2=bre=1;
                        break;
                    case 'd':
                        if(i+1<cnt) i++;
                    case 'a':
                        if(i-1>=0) i--;
                    default:
                        break;
                }
            }
            else {
                gotoxy(57, 35);
                printf("    [유효기간 내의 편지가 아닙니다 (자동으로 넘겨집니다)]");
                SSleep(3);
                if(i+1<cnt) i++;
                else i--;
            }
        }
    }

    //---------------------------------------------------------------------------------------------------

    bre2=bre=0;                                               //작업 전 문단 수 읽기, 그에 따른 문단 배열 생성&초기화
    CursorView(0);
    fgets(letter_mainc, sizeof(letter_mainc), fp);
    letter_mainc[0]-=48;
    char letter_main[letter_mainc[0]][8][540];
    for(i=0;i<(int)letter_mainc[0];i++) {
        for(j=0;j<8;j++) {
            strcpy(letter_main[i][j] , "");
        }
    }
    if(lselect) {                                                  //읽기시 출력 코드들                                    
        drawbody();
        drawmain();
        beforerand(0);
        for(i=0;i<(int)letter_mainc[0];i++) {                                 //사전 읽고 디코딩 작업
            for(j=0;j<8;j++) {
                fgets(letter_main[i][j], sizeof(letter_main[i][j]), fp);
                eCoding(0, letter_main[i][j], sizeof(letter_main[i][j]), '\n');
            }
        }
        fclose(fp);                                                     //파일 읽기 종료
        gotoxy(44, 3);
        printf(" %s 에게                                            ", letter_top);
        for(k=0;k<(int)letter_mainc[0]/4+(((int)letter_mainc[0]%4)/((int)letter_mainc[0]%4));k++) { 
            for(i=0;i<4&&((k*4+i)<(int)letter_mainc[0]);i++) {                              //페이지, 문단별 출력
                CursorView(0);
                for(j=0;j<8;j++) {
                    gotoxy(44, 5+i*9+j);
                    printf("%s", letter_main[k*4+i][j]);
                    SSleep(1);
                }
                gotoxy(44, 6+i*9+j);
                CursorView(1);
                getch();
            }
            CursorView(0);
            if(k+1<(int)letter_mainc[0]/4+(((int)letter_mainc[0]%4)/((int)letter_mainc[0]%4))) drawmain();
        }
        gotoxy(44, 42);
        printf("                                                         %d.%02d.%02d, %s 가     ", letter_limit[2][0], letter_limit[2][1], letter_limit[2][2], letter_bottom);
        CursorView(0);
    }

    //---------------------------------------------------------------------------------------------------

    else {                                   //파일 변환시 (인코딩)
        printf("0");
        for(i=0;i<(int)letter_mainc[0];i++) {
            for(j=0;j<8;j++) {
                fgets(letter_main[i][j], sizeof(letter_main[i][j]), fp); 
            }
        }
        fclose(fp);                                 //일단 다 읽어놓고 닫기
        beforerand(1);
        eCoding(1, letter_top, sizeof(letter_top), '\0');                     //문단 인코딩 작업
        eCoding(1, letter_bottom, sizeof(letter_bottom), '\0');
        eCoding(1, letter_ps, sizeof(letter_ps), '\0');
        beforerand(0);
        for(i=0;i<(int)letter_mainc[0];i++) {                          //본문 인코딩 작업
            for(j=0;j<8;j++) {
                eCoding(1, letter_main[i][j], sizeof(letter_main[i][j])-1, '\n');
            }
        }
        for(i=0;letter_title[i]!='\0';i++) {        //편지 파일 이름 글자수 세기
            if(letter_title[i]=='\0') {
                break;
            }
        }
        if(i<=29) {
            letter_title[i]='_';
            letter_title[i+1]='\0';
        }
        fp2=fopen(letter_title, "w");                       //변환된 편지이름으로 출력
        fprintf(fp2, "%s\n", letter_top);
        fprintf(fp2, "%s\n", letter_bottom);
        fprintf(fp2, "%s\n", letter_ps);
        fprintf(fp2, "%d\n", letter_mainc[0]);
        for(i=0;i<(int)letter_mainc[0];i++) {                   //변환된 본문 출력
            for(j=0;j<8;j++) {
                fprintf(fp, "%s", letter_main[i][j]);
            }
        }
        for(j=13;j<18;j++) {
            gotoxy(56,19+j);
            printf("|                                                              |");
        }
        gotoxy(57, 35);
        printf("                 편지로 변환이 완료되었습니다!             ");
        fclose(fp2);
    }
    SSleep(3);
    goto home;
}   

//----------------------------------------------------------------------------------------------------------

void beforerand(int a) {  //사전 시드 설정 작업, 0이면 시간 포함 시드 설정, 1이면 코드로 시드설정
    if(!a) srand(letter_limit[0][0]+letter_limit[0][1]+letter_limit[0][2]+letter_limit[0][3]+letter_limit[1][0]+letter_limit[1][1]+letter_limit[1][2]+letter_limit[1][3]+'a'+'u'+'t'+'u'+'m'+'n');
    else srand('w'+'i'+'n'+'t'+'e'+'r');
}
void gotoxy(int x,int y) { //gotoxy함수 
    COORD pos={x,y};
    SetConsoleCursorPosition(GetStdHandle(STD_OUTPUT_HANDLE),pos);
}
void SSleep(int a_second) { //잠시 쉬기
    clock_t start_clk = clock();  // 시작 시간을 구한다.
    a_second--;
    while (1) {                  // 지속적으로 clock 함수를 호출하여 흘러간 시간을 계산한다.
        if ((clock() - start_clk) / CLOCKS_PER_SEC > a_second) break;
    }
}
void CursorView(int a) { //커서 활성화 여부 (1이 보임, 0이 안 보임)
    CONSOLE_CURSOR_INFO cursorInfo = { 0, };
    cursorInfo.dwSize = 1; //커서 굵기 (1 ~ 100)
    cursorInfo.bVisible = a?TRUE:FALSE; //커서 Visible TRUE(보임) FALSE(숨김)
    SetConsoleCursorInfo(GetStdHandle(STD_OUTPUT_HANDLE), &cursorInfo);
}
void RemoveEnter(char *sentence, int siz) {
    int i;
    for(i=0;sentence[i]!='\0'&&i<siz;i++) {
        if(sentence[i]=='\n') sentence[i]='\0';
    }
}
void eCoding(int a, char sentence[], int siz, char end_char) { //1일시 인코딩(변환) 0일시 디코딩(읽기)
    int i;
    if(a) {
        for(i=0;sentence[i]!=end_char&&i<siz;i++) {
            sentence[i]=sentence[i]+rand()%3;
        }
    }
    else {
        for(i=0;sentence[i]!=end_char&&i<siz;i++) {
            sentence[i]=sentence[i]-rand()%3;
        }
    }
}
void drawmain() {    //기본 편지 양식 작성
    int i;
    for(i=0;i<46;i++) {
        gotoxy(42, 1+i);
        switch(i) {
            case 0: case 45: printf(" ____________________________________________________________________________________________ "); break;
            default:  printf("| %90s |", " "); break;
        }
    }
}
int time_vaild() {                  //시간 검증 함수
    long long int letter_vaild[3];
    int bre=1;int t;
    for(i=0;i<3;i++) {
        letter_vaild[i] = letter_limit[i][0]*365*24+letter_limit[i][2]*24+letter_limit[i][3];
        t=letter_limit[i][1];
        bre=1;
        while(bre) {
            switch(t) {
                case 12: case 10: case 8: case 7: case 5: case 3: case 1:
                    letter_vaild[i]+=31*24;
                    break;
                case 11: case 9: case 6: case 4:
                    letter_vaild[i]+=30*24;
                    break;
                case 2:
                    if((letter_limit[i][0]%4==0&&letter_limit[i][0]%100!=0)||letter_limit[i][0]%400==0) {
                        letter_vaild[i]+=29*24;
                    }
                    else {
                        letter_vaild[i]+=28*24;
                    }
                    break;
                default:
                    bre=0;
                    break;
            }
            t--;
        }
    }
    if(letter_vaild[0]>=letter_vaild[2]&&letter_vaild[1]<=letter_vaild[2]) return 1;
    else return 0;
}
void drawletter() {   //편지 모양 쓰기
    for(i=0;i<20;i++) {
        gotoxy(56, 15+i);
        switch(i) {
            case 0:  printf(" ______________________________________________________________ "); break;
            case 1:  printf("| _                                                          _ |"); break;
            case 2:  printf("|   _                                                      _   |"); break;
            case 3:  printf("|     _                                                  _     |"); break;
            case 4:  printf("|       _                                              _       |"); break;
            case 5:  printf("|         _                                          _         |"); break;
            case 6:  printf("|           _                                      _           |"); break;
            case 7:  printf("|             _                                  _             |"); break;
            case 8:  printf("|                _                            _                |"); break;
            case 9:  printf("|                   _                      _                   |"); break;
            case 10: printf("|                       _              _                       |"); break;
            case 11: printf("|                          __________                          |"); break;
            case 12: printf("|                                                              |"); break;            
            case 13: printf("|                      _o   _  _  _|_  _   ,_                  |"); break;
            case 14: printf("|               |  |  | |  / |/ |  |  |/  /  |                 |"); break;
            case 15: printf("|                \\/ \\/  |_/  |  |_/|_/|__/   |_/               |"); break;
            case 16: printf("|                            b e t a                           |"); break;
            case 17: printf("|                                                              |"); break;
            case 18: printf("|                                                              |"); break;
            case 19: printf(" -------------------------------------------------------------- "); break;
        }
    }
}
void drawoletter() {   //편지 모양 쓰기
    int i;
    for(i=0;i<30;i++) {
        gotoxy(56, 9+i);
        switch(i) {
             case 0: printf("                           __________                           "); break;
             case 1: printf("                        /              \\                        "); break;
             case 2: printf("                      /                  \\                      "); break;
             case 3: printf("   _________________/______________________\\_________________   "); break;
             case 4: printf("  |                             |                            |  "); break;
             case 5: printf("  |                            |                             |  "); break;
             case 6: printf("  |                             |                            |  "); break;
             case 7: printf("  |                            |                             |  "); break;
             case 8: printf("  |                             |                            |  "); break;
             case 9: printf("  |                            |                             |  "); break;
            case 10: printf("| |                             |                            | |"); break;
            case 11: printf("| _                            |                             _ |"); break;
            case 12: printf("|   _                           |                          _   |"); break;
            case 13: printf("|     _                        |                         _     |"); break;
            case 14: printf("|       _                       |                      _       |"); break;
            case 15: printf("|         _                    |                     _         |"); break;
            case 16: printf("|           _                   |                  _           |"); break;
            case 17: printf("|             _                |                 _             |"); break;
            case 18: printf("|                _              |             _                |"); break;
            case 19: printf("|                   _          |           _                   |"); break;
            case 20: printf("|                       _              _                       |"); break;
            case 21: printf("|                          __________                          |"); break;
            case 22: printf("|                                                              |"); break;            
            case 23: printf("|                                                              |"); break;
            case 24: printf("|                                                              |"); break;
            case 25: printf("|                                                              |"); break;
            case 26: printf("|                                                              |"); break;
            case 27: printf("|                                                              |"); break;
            case 28: printf("|                                                              |"); break;
            case 29: printf(" -------------------------------------------------------------- "); break;
        }
    }
}
void drawbody() {   //화면 출력 함수
    int snowx, snowy;
    gotoxy(0, 0);
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣟⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣤⣤⢴⣿⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣤⠀⠀⠀⣔⣯⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠛⡷⠁⠀⠀⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣤⣤⡤⠀⠀⠀⠀⠀⠀⠀⠋⠠⣸⡾⣿⣆⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠓⣔⠀⢀⢿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀⢀⢴⡯⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀⠛⡿⣬⠀⠀⠀⠀⠀⠀⠀⠀⢐⣽⠀⠐⡽⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣔⡀⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣴⣰⢙⠀⡀⢀⣤⣤⡤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠋⠀⠀⠈⠙⣿⣤⠀⠀⠀⠀⠀⠀⣿⠃⠁⠀⠀⠀⠀⠀⠀⠀⠀⠛⠙⡛⢛⣿⣤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠋⠛⠛⠛⡿⣤⢦⢴⢔⡿⣿⣯⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⢟⠏⠫⠋⠫⠋⠓⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠛⣟⠄⠀⠀⠀⢀⡿⠀⠀⠀⠀⠀⠀⠀⢀⠀⡀⣴⢴⢽⠓⠛⣯⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣤⢀⠀⠀⠀⠀⠀⠀⠁⠀⠀⠫⢷⠁⠀⠀⠀⠀⠀⠀⠀⢀⣴⡻⠚⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡿⡀⠀⣿⠋⠂⠀⠀⢀⠠⣰⡴⡿⠙⠙⠙⠀⠀⠠⣰⣟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣷⣆⠄⠀⠀⠀⠀⠀⠀⠀⠀⠈⣯⣆⠄⠀⠀⠀⢀⣴⢟⠎⠈⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣗⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⣻⣤⡦⣿⠀⡀⢀⢀⢿⠙⠋⠀⠀⠀⠀⠀⠀⠀⠐⡯⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠛⠹⣿⣿⢴⢤⣆⠄⡀⢀⠀⠀⠈⠚⡿⡤⡀⢀⢀⣿⠙⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣟⠓⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡤⠀⠀⠀⠀⠀⠀⠀⠀⢀⠠⣿⢋⢈⢙⠫⣟⠓⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⢿⠙⠀⠁⠋⠫⠋⠫⢿⢴⣤⢀⢀⣵⣽⠫⣷⢋⢀⠀⡀⢀⠀⡀⠀⠀⢀⣴⣟⠓⠀⢀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣷⠛⠀⢀⠀⡀⣤⢦⢴⢔⡿⡙⠝⢙⢷⠋⠛⡿⣔⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡴⡯⠓⠁⠀⠀⠀⠀⠀⠀⠀⠈⠀⠋⠫⢓⣿⡿⣿⡿⡋⠓⠋⠏⠋⠏⣷⣥⣦⣿⣷⣦⢴⣔⡿⠙⠓⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⣯⡦⡴⡿⠙⠙⠝⠀⠁⠀⠀⠀⠀⠀⣿⠀⠀⠈⠹⣗⡁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣔⡯⠓⠁⠀⣿⣤⠀⠀⠀⠀⠀⠀⠋⠫⠛⠹⣻⢴⣤⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠫⢷⣥⢀⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⣽⠀⠀⠀⠀⠫⢷⣥⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⡀⠀⠀⠀⢀⣴⣟⠓⠀⠈⠀⠀⠀⠀⠫⢿⣔⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠚⠹⡻⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠚⡷⣦⣤⢀⠀⠀⠀⠀⠀⠀⠀⠐⣽⠀⠀⠀⠀⠀⠈⠚⣿⣔⡀⠀⠀⠀⠀⡀⣦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠋⠫⠛⠙⣿⣴⣔⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣯⣦⢀⢀⣴⢤⢦⢴⢤⡢⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠋⠓⠀⠀⠀⠀⠀⠀⠀⢐⣽⠀⠀⠀⠀⠀⠀⠀⠀⠫⢷⣥⠀⠀⢐⣽⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⣻⠙⠀⠫⡿⡀⠀⠀⠀⠀⠀⠀⠀⣴⣿⡿⣿⣷⠋⠂⠁⠀⠁⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⣻⠓⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠚⣿⣬⣷⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠚⠀⠀⠀⠀⡿⠀⠀⠀⠀⠀⠀⢀⣬⠚⠙⠀⠀⠫⢿⡤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⣰⠀⠀⠀⣿⠀⠀⠀⢀⠀⠀⠀⠀⠀⠀⠀⢀⢀⣿⡟⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣻⠃⠁⠀⠀⠀⠀⠀⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⣻⣤⠀⢈⢾⡀⣴⣔⡷⠀⠀⠀⠀⠀⠀⠈⡾⠋⠓⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠋⠓⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠛⡿⡴⡿⣟⠓⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠀⡀⣴⣤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡴⣟⠝⠹⣻⠫⢿⣔⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣤⣤⣤⣤⡤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⢯⠂⠈⢙⢷⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠛⣿⣤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢈⡾⠁⠀⠀⠀⠛⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡿⠛⡿⣔⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠋⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠹⣳⣥⠀⠀⠀⠀⠀⠀⠀⢀⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡴⣤⣆⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀⠀⠀⣿⠓⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣾⣤⠀⠀⠀⣆⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠫⠛⣴⣤⠀⡀⠀⡀⣿⠋⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠛⡿⣤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣤⠀⠈⣾⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⣗⠁⢀⢬⠚⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠋⠫⠛⣿⢿⠹⣯⢀⠀⡀⠀⡀⠀⡀⢀⢀⣴⢤⢦⣢⢦⢴⣬⣯⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣤⡤⣆⡀⢀⠀⡓⣴⣬⡾⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⢿⢀⣴⡟⠄⠀⠀⠀⡀⢀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣤⡤⠀⠀⠀⢀⠀⡀⡀⣴⡤⡦⣿⣔⢀⢿⠙⠝⠙⠋⠫⠋⠫⠓⠛⠊⠂⠁⠀⠀⣥⡿⠓⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠝⠙⠝⠙⠫⢿⣔⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⣿⣿⢷⡥⡦⣔⡴⡿⠙⠝⠙⠃⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡿⡀⣦⣢⢴⢿⠙⠓⠋⠫⠀⠀⠐⣽⡴⣿⣔⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡴⣟⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⣷⣥⠀⠀⠀⠀⠀⠀⠀⠀⡀⡿⠋⠀⠀⠀⠈⠀⠀⠈⠀⠀⢀⣔⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡿⡿⣿⣟⡀⡀⠀⠀⠀⠀⠀⠀⢀⢈⢯⠂⠀⠫⢷⢦⣢⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣔⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠫⢿⣔⡀⠀⠀⠀⠠⣰⣗⠁⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⣯⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠋⠋⠓⠁⠀⠀⠀⠀⢠⣻⠃⠁⠀⠀⠀⠀⠁⠛⡷⣆⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠫⢷⣦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢙⢷⡀⡀⠠⣰⢿⠋⠂⠀⢀⢀⢀⠠⣰⡤⣦⣿⣿⠙⠓⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡿⡃⠁⠀⠀⠀⠀⠀⠀⠀⠈⠹⢯⣆⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠀⡀⠈⠚⣿⣔⡀⠀⠀⢀⠀⡀⢀⠀⡀⢛⡿⡚⣿⣔⡀⡀⣴⣔⣟⠓⠋⠛⠙⠀⠀⠫⢷⡦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⣽⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⣿⣤⠀⠀⠀⣤⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠋⠫⡷⣦⣢⣴⣿⣷⣦⣢⡿⡙⠝⠙⠝⠙⠝⣿⡿⣿⣿⢙⠙⠓⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠹⢷⢥⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣔⠀⢀⢴⣟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢛⣿⣴⣬⢷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠠⣰⣔⡿⠙⠙⠝⠋⠀⠀⠀⠀⠀⢀⣴⣗⠁⠀⠛⡷⣦⣢⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣯⠂⣴⢟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣔⡿⠙⠙⠙⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⡽⡋⠏⠀⠀⠁⠀⠀⠀⠀⠀⠀⠀⣴⡟⠇⠂⠀⠀⠀⠀⠀⠛⣿⣔⡀⠀⠀⢀⢀⠀⡀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣴⣯⠂⡀⣦⣢⣔⠀⠀⠀⠀⠀⠀⠀⠀⠀⠋⠓⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡴⣤⣢⢴⢤⣆⡀⡀⣼⣞⠄⠀⠀⠀⠀⠀⠀⠀⠀⡀⣿⡷⣦⣼⣞⠓⠋⠛⠪⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠋⠋⠏⠋⠫⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠫⣿⢿⢿⣿⣤⠀⠀⠀⠀⠀⠀⠀⢀⢿⠙⠈⠹⢷⣆⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡴⣟⠏⠂⠁⠋⠳⣰⠀⠀⠀⠀⠀⠀⠀⡿⠀⠀⠀⠀⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠛⣟⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠛⠙⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    printf("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");
    gotoxy(0, 0);
    beforerand(1);
    for(snowy=0;snowy<50;snowy++) {
        for(snowx=0;snowx<177;snowx++) {
            gotoxy(snowx, snowy);
            if(!(rand()%55)) {
                printf("*");
            }
        }
    }
}